tutorials/cgnsConverters/test2/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    hub
    {
        type            zeroGradient;
    }

    shroud
    {
        type            zeroGradient;
    }

    inflow
    {
        type            fixedValue;
        value           uniform 3.0;
    }

    outflow
    {
        type            zeroGradient;
    }

    perio1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
